{
    "COFFEEDRANK": 0,
    "CAFEOUTOFCOFFEE": false,
    "CARRYINGPIE": false,
    "DEFENDERPASSES": 0,
    "JOUSTPASSES": 0,
    "WONPACMAN": false,
    "WONDEFENDER": false,
    "WONJOUST": false,
    "MYSTICACCEPTED": false,
    "TAOACCEPTED": false,
    "ASCETICACCEPTED": false,
    "HEDONISTACCEPTED": false,
    "STOICACCEPTED": false,
    "SHINY": false,
    "BEGIN": {
        "predescription": {
            "condition": "not BEGIN['visited']",
            "description": "Welcome to Wandering Whimsy!"
        },
        "description": "You are standing on the sidewalk in a rundown beach town.",
        "postdescription": "The Moonshot cafe is to your right. The arcade to your left. Ahead of you is a sign indicating beach access.",
        "options": [
            {
                "label": "Enter the cafe",
                "destination": "CAFE"
            },
            {
                "label": "Go to the arcade.",
                "destination": "ARCADE"
            },
            {
                "label": "Walk down to the beach",
                "destination": "SBEACH"
            }
        ]
    },
    "CAFE": {
        "description": "The cafe smells of hot grease and burnt coffee. The shabby, false wood panelled walls are smattered with flyers for boats and trailers for sale, real estate advertisements, and pictures of the local softball team.",
        "options": [
            {
                "label": "Order coffee",
                "destinations": {
                    "if": "CAFEOUTOFCOFFEE",
                    "then": "CAFEHASNOCOFFEE",
                    "else": "CAFEORDERCOFFEE"
                }
            },
            {
                "condition": "not CARRYINGPIE",
                "label": "Order a custard pie",
                "message": "The waitress hands you a pie.",
                "flag": "CARRYINGPIE",
                "destination": "CAFE"
            },
            {
                "label": "Talk to retirees",
                "destination": "RETIREESSTART"
            },
            {
                "label": "Go outside",
                "destination": "BEGIN"
            }
        ]
    },
    "CAFEORDERCOFFEE": {
        "description": "It tastes terrible.",
        "destination": "CAFE",
        "flag": "CAFEOUTOFCOFFEE",
        "increment": "COFFEEDRANK"
    },
    "CAFEHASNOCOFFEE": {
        "description": "Sorry hon. We're fresh out of coffee.",
        "destination": "CAFE"
    },
    "RETIREESSTART": {
        "description": "One table has three retirees sitting around it. A big, tall gentlemen with a wrinkled face and sagging jowls. A shorter, portly man with a wisp of white hair combed over his shiny pate. And a clearly once attractive woman. She has wrinkles at the corners of her eyes and mouth like starburst and when she is smiling, which seems often, her cheeks stand out, shiny and reddish. The table itself is loaded with food, omelets, hashbrowns, and enourmous cinnamon rolls. Steam rises from the food and coffee cups with amazing aromas. Your stomach growls.\n\"Howdy stranger\", the tall man smiles in a friendly way. \"Join us for breakfast?\"",
        "options": [
            {
                "label": "Sit down in the empty chair.",
                "destination": "BREAKFAST"
            },
            {
                "label": "\"No thanks.\"",
                "destination": "REJECTHEDONIST"
            }
        ]
    },
    "BREAKFAST": {
        "description": "The cheerful woman passes you a cup of coffee and slides over the largest cinnamon roll you have ever seen. It easily fills the dinner plate it sits on, it's taller than it is wide and it's drenched in cream cheese frosting. You're salivating and slightly sick at the same time. Have you ever eaten anything larger than your own head? \n\"Whale-sized pastries are Mabeliene's special-ality.\", says the smiling lady with just a bit of a southern drawl. \"Eat, drink and be merry. Isn't that right Larry?\" \nWhen the portly man smiles back at her his eyes disappear into a squint and a small chuckle makes his round belly jiggle.",
        "options": [
            {
                "label": "You find yourself smiling with him and taste your coffee.",
                "destination": "BREAKFAST2"
            },
            {
                "label": "The display of gluttony is too much. You rise to leave.",
                "destination": "REJECTHEDONIST"
            }
        ]
    },
    "BREAKFAST2": {
        "description": "The coffee is truly awful. \nBut the cinnamon roll is ambrosia itself. The frosting is the perfect balance of sweet and tangy, the dough is chewy and fluffy and delightfully warm. You lose yourself for a moment in sugar loaded ecstasy. \n\"Try the omlet.\", offers the tall man. His long jowly face seems naturally mournful and his brown eyes seem to hold a sadness but when he sees you enjoying the food (bacon, cheese and potatoes cooked in eggs and topped with country gravy) his smile is sincere and makes his sad eyes sparkle just a little. \n\"Always a pleasure to see a young person enjoy themselves.\", the cheery woman says. \"Why, when my grandson used to visit I'd bring him here every morning. You wouldn't believe how much he'd pack away. But a growing and active young person has to keep up their strength.\"",
        "increment": "COFFEEDRANK",
        "options": [
            {
                "label": "Continue eating, even though you're getting full already.",
                "destination": "BREAKFAST3"
            },
            {
                "label": "Thank them and leave.",
                "destination": "REJECTTHEHEDONIST"
            }
        ]
    },
    "BREAKFAST3": {
        "description": "As you continue to nibble, a bit of the lives of the three retirees comes out. All of them carry sorrow and joy. The woman spent her last 10 years before retirement on the late stage cancer ward of a children's hospital. Work she is proud of but clearly took a toll. The portly man was a public defender for 38 years in Chicago. He barely made enough money to retire. The tall man was a salesman who did alright but never saw his family much. All three of them are mostly estranged from children and grandchildren. She is a widow, the portly man a windower and the tall man a divorcee. All have numerous age and vocation related health issues (which they discuss at length) exacerbated by obesity and a sedentary lifestyle. But they enjoy the food and a fresh face. They seem to want nothing more than to feed you and talk at you. They laugh a lot.",
        "options": [
            {
                "label": "Join in the laughter.",
                "destination": "ACCEPTHEDONIST"
            },
            {
                "label": "Thank them and leave before you're too stuffed to move.",
                "destination": "REJECTHEDONIST"
            }
        ]
    },
    "ACCEPTHEDONIST": {
        "description": "\"Life will have ups and down, as they say. And we've seen our share of both.\", The tall man spreads his hands to indicate his companions. \"Nothing for it but to enjoy as much of the simple pleasures as you can along the way. Am I right?\" \nThe cheerful woman smiles. \"You have a delightful time in our little beach town. Join us anytime you like. We'll be here!\" \nThe three of them suddenly begin to systematically demolish the remaining breakfast items. You are a little shocked at their ferocity and efficiency but the laughter, smiles, and talking continue regardless. Mostly praise for Mabeliene's cooking and stories that have clearly been told many, many times already. You thank them as politely as you can and make your exit.\nYou feel extremely full.",
        "destination": "CAFE",
        "flag": "HEDONISTACCEPTED"
    },
    "REJECTHEDONIST": {
        "description": "You rise to leave. Though the disappointment is clear in their eyes the three retirees bid you farewell and good day with friendliness.",
        "destination": "CAFE"
    },
    "SBEACH": {
        "description": "Standing on the south beach, surf is pounding the sand in front of you. To the south the headland juts out into the ocean. To the north a lighthouse stands on a promitory. A fisherman stands is preparing his rod down by the surf.",
        "options": [
            {
                "label": "Go back to main street",
                "destination": "BEGIN"
            },
            {
                "label": "Climb to lighthouse",
                "destination": "TRAILTOLIGHTHOUSE"
            },
            {
                "label": "Talk to fisherman",
                "destination": "FISHERMAN1"
            }
        ]
    },
    "FISHERMAN1": {
        "description": "He's wearing a floppy hat with lures stuck in it, chest high waders, and a scraggly graying beard. He smells strongly of old fish. \nThe fisherman greets you with a friendly smile, \"Howdy there. Welcome to the end of the earth.\"",
        "options": [
            {
                "label": "\"How's fishing?\"",
                "destination": "FISHERMAN2"
            }
        ]
    },
    "FISHERMAN2": { 
        "description": "\"Lousy. Fish won't bite for nothing.\", but his smile only broadens. \"But then I don't like fish much anyway. I just come out here to enjoy the ocean and the sky, the wind and the spray. All that force of nature, makes ya feel alive, ya know? Why do you 'spose people feel that way?\"",
        "destination": "FISHERMAN3"
    },
    "FISHERMAN3": {
        "description": "\"I mean, some people don't feel that way. They prefer staying warm and dry, civilized and comfortable. Different strokes for different folks I 'spose. Takes all kinds. Most people have an internal philosophy, even if they haven't conciously thought it through. Some of the ones who have will try to convince you theirs the only way, but the ones who've thought about it and decided what works for them, but don't need to convince nobody, thems the ones I prefer to chew the fat with. Solid folks I calls 'em. Good for a sharing a cup 'o joe with or just setting out enjoying the wind.\" \nBy this point the fisherman is stroking his beard and staring at the waves. You're not sure he remembers you're there or if he's just musing at the ocean. He might be a little batty.",
        "options": [
            {
                "label": "Why did you call this the \"end of the earth?\"",
                "destination": "FISHERMAN4"
            }
        ]
    },
    "FISHERMAN4": {
        "description": "\"Well look at it! The land comes this far and stops. Looks like the ocean takes over and just goes forever, don' it? 'Sides this town is full of folks running from summin. Running from heartache, or debt, or disease. Or trying run away from here. Running from themselves mostly. Things ain't too good ya know? Not a lot of jobs in a place like this. Hard work, logging or fishin' for a living. Which is why I don't.\", he says with a wink. \"Lots of folks dependent on the tourists, but they come and go. Lots of folks 'round here are just plain down on their luck.\"",
        "options": [
            {
                "label": "\"What about you?\"",
                "destination": "FISHERMAN5"
            }
        ]
    },
    "FISHERMAN5": {
        "description": "\"Me, I just feel lucky to be alive. \nYou enjoy your stay in our town. Talk to folks and take what they're willing to share. You never know what might come in handy or who might just give you a gem. Just don' take anybody too seriously.\"\n And with another wink he stomps off into the surf to cast his line.\nYou look down and see a small dead fish on the sand.",
        "options": [
            {
                "label": "Pick it up?",
                "flag": "HERRING",
                "message": "You found a herring.",
                "destination": "SBEACH"
            },
            {
                "label": "Eww.",
                "destination": "SBEACH"
            }
        ]
    },
    "ARCADE": {
        "description": "The dim arcade has the feel of a place long abandonded. The games are out of service.",
        "postdescription": {
            "condition": "WONPACMAN and WONDEFENDER and WONJOUST",
            "description": "A single light has come on illuminating a concession counter"
        },
        "options": [
            {
                "label": "Go outside",
                "destination": "BEGIN"
            },
            {
                "label": "Look at the machines",
                "destination": "PICKAGAME"
            },
            {
                "condition": "WONPACMAN and WONDEFENDER and WONJOUST",
                "label": "Approach the concessions counter",
                "destination": "ARCADECOUNTER"
            }
        ]
    },
    "LEAVEARCADE": {
        "description": "You pause at the door of the arcade. A breath of distant laughter seems to blow out the door on a cold breeze. The ghosts of ancient electronic sounds tease the corners of your mind. You let the door swing shut and hurry out into the sunlight.",
        "destination": "BEGIN"
    },
    "PICKAGAME": {
        "description": "There are three video games in front of you. Their cabinets dusty and dull. The screens obviously long dark. You find the joysticks and consoles strangely alluring. Should you take a closer look?",
        "options": [
            {
                "label": "Look at Ms. Pac-Man.",
                "destination": "MSPACMAN"
            },
            {
                "label": "Look at Defender.",
                "destination": "DEFENDER"
            },
            {
                "label": "Look at Joust.",
                "destination": "JOUST"
            }
        ]
    },
    "MSPACMAN": {
        "description": "As you touch the dusty console the screen unexpectedly flickers. A small yellow circle appears in a maze filled with dots. A wedge shaped opening in the circle rapidly opens and closes like a mouth as you begin to instinctively direct it around the maze, eating the dots. The ancient electronic sounds emitted by the machine pulse in time as the creature consumes the dots. Suddenly, brightly colored ghosts appear, menacing your little yellow circle. In the room around you, whispers begin and dim, grey figures begin to float around you. \"Go left!\", a voice suddenly shouts.",
        "options": [
            {
                "label": "Direct Ms Pac-Man left.",
                "destination": "EATGHOSTS"
            },
            {
                "label": "This is getting creepy. Get out of there!",
                "destination": "LEAVEARCADE"
            }
        ]
    },
    "EATGHOSTS": {
        "description": "Your hands move the joystick without thinking and the yellow circle eats a larger pellet. The color drains from the screen and the ghosts flee. A memory of a cheering crowd flickers in your mind. Your hands move with unknown skill as you direct your yellow circle precisely around the maze eating pellets and the ghosts. With only two ghosts left the colors return to the screen and they begin to chase you again. Your super power has run out. There is only one corner of pellets left. You begin to move toward them, upper right, but an errie voice whispers in your ear, \"Left, through the tunnel.\"",
        "options": [
            {
                "label": "Move right, towards the pellets.",
                "destination": "LOSEPACMAN"
            },
            {
                "label": "Go left, towards the nearest wall",
                "destination": "WINPACMAN"
            }
        ]
    },
    "WINPACMAN": {
        "description": "The cirlce heads towards a small gap in the left wall and suddenly appears on the right. The ghosts are thrown off as they suddenly must change directions. You drive up into the remaining corner of pellets. When the last is eaten a jingle of trimuph plays from the ancient speakers of the machine and echoes of cheers resound in the huge empty arcade. You look all around. There is no one there.",
        "flag": "PACMANWON",
        "destination": "ARCADE"
    },
    "LOSTPACMAN": {
        "description": "Your little yellow circle crumples and disappears when the ghosts catch it. A slight breeze sighs with disappointment as it raises the hairs on your neck. \"Would you like to try again?\", the machine asks in friendly yellow block letters.",
        "destination": "ARCADE"
    },
    "DEFENDER": {
        "increment": "DEFENDERPASSES",
        "predescription": {
            "condition": "DEFENDERPASSESS == 0",
            "description": "As you approach the game flickers to life."
        },
        "description": "Your tiny ship appears in the center of the screen. The fire button makes dramatic laser blasts shoot towards your enemies... and your friends. Aliens are abducting colonists from the planet's surface, laying mines, and of course hunting you. Your ship responds to the slightest touch of the controls with speed and power. What will you do?",
        "options": [
            {
                "label": "FIRE!",
                "destinations": {
                    "if": "choice(True, False)",
                    "then": "DEFENDER",
                    "else": "LOSTDEFENDER"
                }
            },
            {
                "label": "Rescue that colonist!",
                "destinations": {
                    "if": "choice(True, False)",
                    "then": "DEFENDER",
                    "else": "LOSTDEFENDER"
                }
            },
            {
                "label": "Dodge the mine!",
                "destinations": {
                    "if": "choice(True, False)",
                    "then": "DEFENDER",
                    "else": "LOSTDEFENDER"
                }
            },
            {
                "condition": "DEFENDERPASSES >= 2",
                "label": "Fire a bomb!",
                "destination": "WONDEFENDER"
            }
        ]
    },
    "WONDEFENDER": {
        "eval": {
            "flag": "DEFENDERPASSES",
            "exp": "0"
        },
        "description": "The bomb was well timed. The minelayer and abductors vaporize. Your heart is racing with andrenaline but your hands are steady. In a bit of brilliant flying you swoop in and rescue the falling colonist. A perfectly aimed laser blast destroys the last hunter. You are victorious.",
        "destination": "ARCADE",
        "flag": "WONDEFENDER"
    },
    "LOSTDEFENDER": {
        "eval": {
            "flag": "DEFENDERPASSES",
            "exp": "0"
        },
        "description": "Your tiny ship explodes in a brilliant display of light. \"GAME OVER\" is displayed in large red letters.",
        "destination": "ARCADE"
    },
    "JOUST": {
        "increment": "JOUSTPASSES",
        "predescription": {
            "condition": "JOUSTPASSESS == 0",
            "description": "As you approach the game flickers to life."
        },
        "description": "The noble knight sits atop his... ostrich?",
        "options": [
            {
                "label": "Flap!",
                "destinations": {
                    "if": "choice(True, False)",
                    "then": "JOUST",
                    "else": "LOSTJOUST"
                }
            },
            {
                "label": "Go Left!",
                "destinations": {
                    "if": "choice(True, False)",
                    "then": "JOUST",
                    "else": "LOSTJOUST"
                }
            },
            {
                "label": "Go Right!",
                "destinations": {
                    "if": "choice(True, False)",
                    "then": "JOUST",
                    "else": "LOSTJOUST"
                }
            },
            {
                "condition": "JOUSTPASSES >= 2",
                "label": "Dodge the lava monster!",
                "destination": "WONJOUST"
            }
        ]
    },
    "WONJOUST": {
        "eval": {
            "flag": "JOUSTPASSES",
            "exp": "0"
        },
        "description": "You un-buzzard the last remaining enemy knight with a perfectly executed double flap and glide maneuver. You have earned your spurs this day.",
        "destination": "ARCADE",
        "flag": "WONJOUST"
    },
    "LOSTJOUST": {
        "eval": {
            "flag": "JOUSTPASSES",
            "exp": "0"
        },
        "description": "The knight falls from his ostrich and does not rise again.",
        "destination": "ARCADE"
    },
    "ARCADECOUNTER": {
        "description": "\"You did pretty good on those games over there.\" The disembodied voice shocks you to the core. Suddenly the lights are bright, the dusty counter is gleaming and the popcorn machine lights up and wafts it's delicious smell around the room. \"What can I get ya?\" A middle aged man with greying beard, long crooked nose, and pointed chin slowly appears behind the counter. He smiles at you. The drink machine turns on, the cola sign clearly visible through the man's head.",
        "options": [
            {
                "label": "Uh, a small popcorn please?",
                "destination": "STOIC1"
            },
            {
                "label": "Run away screaming.",
                "destination": "LEAVEARCADE"
            }
        ]
    },
    "STOIC1": {
        "description": "The popcorn smells like butter. The bag he hands you is still warm. Settling his elbows on the counter he sighs and asks, \"So, what's new out there? Any good games come out lately?\"",
        "options": [
            {
                "label": "\"Aren't you dead? Can a ghost play a video game?\"",
                "destination": "REJECTSTOIC"
            },
            {
                "label": "\"What makes a game good?\"",
                "destination": "STOIC2"
            }
        ]
    },
    "STOIC2": {
        "description": "\"With a good game there's always an element of chance. The result is always outside your control. With a good game it's not about whether you win or lose, it's how you play the game. Just like life.\" As the concessionaire fades from view you hear a whisper, \"You gotta play with style.\" \nThe lights go out and your popcorn disappears but the salty, buttery taste lingers.",
        "flag": "STOICACCEPTED",
        "destination": "ARCADE"
    },
    "REJECTSTOIC": {
        "description": "\"Humph! Have it your way kid.\"",
        "destination": "ARCADE"
    },
    "TRAILTOLIGHTHOUSE": {
        "description": "A steep, narrow track leads up the cliff in  a series of switchbacks.",
        "options": [
            {
                "label": "Continue?",
                "destination": "LIGHTHOUSE"
            },
            {
                "label": "Turn back?",
                "destination": "FALLTODEATH"
            }
        ]
    },
    "TRAILFROMLIGHTHOUSE": {
        "description": "A steep, narrow track leads down the cliff in a series of switchbacks.",
        "options": [
            {
                "label": "Continue?",
                "destination": "SBEACH"
            },
            {
                "label": "Turn back?",
                "destination": "FALLTODEATH"
            }
        ]
    },
    "FALLTODEATH": {
        "description": "Fortune favors the bold as they say. Your timid nature betrays you as a gust of wind slams into you, blowing you off the path.",
        "destination": "END"
    },
    "LIGHTHOUSE": {
        "description": "As you approach the light house a strange demon like creature runs out and past you. Screaming. You die of fright.",
        "destination": "END"
    },
    "NBEACH": {
        "description": "A long flat beach seems to continue on forever and disappear into the fog. The interminable pound of the cold blue gray surf on one hand and rolling sandy dunes on the other. Tufts of salt grass bend in the wind and loose sand skates across ground. A flock of tiny white birds chase the waves as they advance and retreat. ",
        "options": [
            {
                "label": "Go to the lighthouse.",
                "destination": "LIGHTHOUSE"
            },
            {
                "label": "Enter the dunes.",
                "destination": "DUNES1"
            }
        ]
    },
    "DUNES1": {
        "description": "The dunes are lumpy, sandy hills, mostly topped with coarse grass. Behind you is the beach and ahead is a line of dark, twisted, and bent pine trees. One trail wanders ahead and enters the trees, another continues through the dunes.",
        "postdescription": {
            "condition": "choice((True, False))",
            "description": "A mysterious tower rises out of the fog in the distance."
        },
        "options": [
            {
                "label": "Follow the trail to the forest.",
                "destination": "TREES1"
            },
            {
                "label": "Follow the trail through the dunes.",
                "destinations": {
                    "if": "choice((True, False))",
                    "then": "DUNES1",
                    "else": "DUNES2"
                }
            }
        ]
    },
   "DUNES2": {
        "description": "The dunes are sandy, lumpy hills, mostly topped with coarse grass. Behind you is the beach and ahead is a line of dark, twisted, and bent pine trees. One trail wanders ahead and enters the trees, another continues through the dunes.",
        "postdescription": {
            "condition": "choice((True, False))",
            "description": "The spice must flow."
        },
        "options": [
            {
                "label": "Follow the trail to the forest.",
                "destination": "TREES1"
            },
            {
                "label": "Follow the trail through dunes.",
                "destinations": {
                    "if": "choice((True, False))",
                    "then": "DUNES1",
                    "else": "DUNES3"
                }
            }
        ]
   },
   "DUNES3": {
        "description": "In a bowl shaped depression between dunes there is a bald figure seated on a log. He sits with his legs folded, back straight and eyes closed. His hands rest on his knees. He appears to be wearing a bed sheet.",
        "options": [
            {
                "label": "Speak with mystic.",
                "destination": "MYSTIC1"
            },
            {
                "label": "Continue on path",
                "destination": "DUNES1"
            }
        ]
   },
   "MYSTIC1": {
       "description": "As you approach the old man his eyes snap open. His gaze is riveting and seems to tear away all pretense as he looks into your very soul. \nHe also smells very bad.\n\"Do you seek the way?\", he asks.",
       "options": [
           {
               "label": "\"Yes, I seek the way.\"",
               "destination": "MYSTICWAY"
           },
           {
               "label": "\"What is this way?\"",
               "destination": "MYSTICWAY"
           }
       ]
   },
   "MYSTICWAY": {
       "description": "\"Your feet are already upon it.\", he intones. \"The path of life of life is suffering. What does not kill you makes you stronger. \"",
       "options": [
           {
               "label": "Nod, knowingly.",
               "destination": "MYSTICWAY2"
           },
           {
               "label": "\"That's baloney.",
               "destination": "MYSTICREJECT"
           }
       ]
   },
   "MYSTICWAY2": {
       "description": "His voice rises, \"Try looking into that place where you dare not look! If you gaze long enough into an abyss, the abyss will gaze back into you. Face your fear, for fear is the mind-killer!\"",
       "options": [
           {
               "label": "Nod, knowingly.",
               "destination": "MYSTICWAY3"
           },
           {
               "label": "\"You're a couple fries short of a happy meal mister.\"",
               "destination": "MYSTICREJECT"
           }
       ]
   },
   "MYSTICWAY3": {
       "description": "His litany takes on a chanting quality and falls to a whisper, \n\"God is dead. God remains dead. And we have killed him. How shall we comfort ourselves?\"\nLastly, barely audible above the wind you hear,\n\"It is by will alone I set my mind in motion. The spice must flow.\"",
       "options": [
           {
               "label": "Nod, knowingly.",
               "destination": "MYSTICACCEPT"
           },
           {
               "label": "Back away slowly.",
               "destination": "MYSTICREJECT"
           }
       ]
   },
   "MYSTICACCEPT": {
       "description": "The mystic nods back and closes his eyes again. You feel, somehow lighter, uplifted in a strange way... \nand yet, utterly confused.",
       "destination": "DUNES3",
       "flag": "MYSTICACCEPTED"
   },
   "MYSTICREJECT": {
       "description": "The mystic begins to scream obscenties and flail his arms. A flock of seagulls descends and swirl around him in a violent temptest of sqwaking, feathery, fury. You run for your life.",
       "destination": "DUNES3"
   },
   "TREES1": {
       "description": "The coastal pines bend over the trail forming a tunnel roofed with their twisted branches. Huckberries grow to head height alongside and the sandy ground is covered with low growing bear berry. \nRight at the entrance to the forrest a pile of black goop and seeds sits in the middle of trail.\nBear scat.\n\nA few yards in, the trail splits.",
       "options": [
           {
               "label": "Continue down the trail and to the right.",
               "destination": "TREES2"
           },
           {
               "label": "Continue down the trail and to the left.",
               "destination": "TREES3"
           },
           {
               "label": "Go back.",
               "destination": "DUNES1"
           }
       ]
   },
   "TREES2": {
       "description": "The trail has a magical feel to it. It's curves and dips leave you with little visibility. Sometimes you must duck to pass the low hanging branches of the trees. Sometimes you are brushed by the huckleberries, heavy with fruit, on either side. Sometimes you pass a small clearing thick with coarse grass. Bear sign and tracks are plentiful. The calls of hawks, larks, and seagulls are common. \nYou stop at a fork in the trail. A squirrel drops a few bits of pinecones on you and then scolds you for disturbing his snack.",
       "options": [
           {
               "label": "Go left",
               "destination": "TREES3"
           },
           {
               "label": "Go right",
               "destination": "TREES4"
           }
       ]
   },
   "TREES3": {
       "description": "The dark tunnel of trail gives you a slightly claustrophobic feeling. You cannot see much ahead. There could be a bear around any corner. Your steps quicken. A smaller trail diverges to your right.",
       "postdescription": {
           "condition": "choice(False, False, False, True)",
           "description": "A bear suddenly steps out a bush just ahead of you!\n\nYou freeze in terror!\n\nBut it seems as surprised as you are. The bear dives across the trail into the bushes again. He hear it crashing through undergrowth as it runs away."
       },
       "options": [
           {
               "label": "Continue",
               "destination": "TREES3"
           },
           {
               "label": "Take the track to the right.",
               "destination": "TREES2"
           }
       ]
   },
   "TREES4": {
       "description": "There is a huge black dog sitting in the middle of the trail. It's pointed ears stand up, it's attention fully on you.",
       "options": [
           {
               "label": "Speak in a calm voice and slowly approach.",
               "destination": "DOG1"
           },
           {
               "label": "Back away slowly",
               "destination": "TREES2"
           }
       ]
   },
   "DOG1": {
       "description": "Slowly you approach the big dog. \"Good dog.\", you try to keep your fear out of your voice. The dog is almost as tall as you are. Gently you rest your hand on it's head and stroke the soft fur between its ears. \nIt's tongue hangs out and it's tail begins to wag, sweeping the trail of leaves and twigs. \nA ragged breath escapes that you didn't realize you were holding in.\nWith a loud bark the dog turns and bounds away up the trail.",
       "destination": "TREES5"
   },
   "TREES5": {
       "description": "You follow the big, black dog around the corner. The trail climbs to your left and the dog disappears up and over the little crest of the hill. To your right the trail descends into shadowed glen.",
       "options": [
           {
               "label": "Climb the hill.",
               "destination": "BAYSIDE1"
           },
           {
               "label": "Explore the glen.",
               "destination": "ASCETICHUT"
           }
       ]
   },
   "TREES6": {
       "description": "The trail climbs to your left over the little crest of the hill. To your right the trail descends into shadowed glen.",
       "options": [
           {
               "label": "Climb the hill.",
               "destination": "BAYSIDE1"
           },
           {
               "label": "Explore the glen.",
               "destination": "ASCETICHUT"
           }
       ]
   },
   "TREES7": {
       "description": "After much wandering through the maze like forest you come out on the dunes.",
       "destination": "DUNES1"
   },
   "ASCETICHUT": {
       "description": "In the middle of a small clearing there is a wooden hut. Smoke curls from a metal stove pipe sticking out the thatched roof. A woman in what looks like a burlap robe sits cross legged on a large flat stone. Hands on her knees and eyes clothes.",
       "options": [
           {
               "label": "Try to talk to her.",
               "destination": "ASCETIC1"
           },
           {
               "label": "Leave quietly",
               "destination": "TREES6"
           }
       ]
   },
   "ASCETIC1": {
       "description": "Her eyes snap open. You notice that she appears very thin and smells bad. Her head is shaved.\n\"Deny thyself, that you may know the truth. It is only through sacrifice that flesh quiets so that the mind may become clearer.\"",
      "options": [
          {
             "label": "\"That sounds like a terrible idea.\"",
             "destination": "REJECTASCETIC"
          },
          {
              "label": "\"What truth?\"",
              "destination": "ASCETIC2"
          }
      ]
   },
   "ASCETIC2": {
       "description": "\"There is no spoon.\"",
       "options": [
           {
               "label": "There is no spoon?",
               "destination": "ASCETIC3"
           }
       ]
   },
   "ASCETIC3": {
       "description": "\"Then you will see it is not the spoon that bends, it is yourself. The higher mysteries of the universe reveal themselves only to those who leave behind desire and need and ascend to the realm of pure thought. Do not indulge your body, lest it ensnare you.\"",
       "options": [
           {
              "label": "\"Got it, thoughts good, body bad.\"",
              "destination": "ACCEPTASCETIC"
           },
           {
               "label": "\"You're a spoon short of a place setting lady.\"",
               "destination": "REJECTASCETIC"
           }
       ]
   },
   "REJECTASCETIC": {
       "description": "The woman releases a huffy breath and shuts her eyes tight. It seems you've been dismissed.",
       "destination": "TREES6"
   },
   "ACCEPTASCETIC": {
       "description": "The woman nods sagely and shuts her eyes again, resuming her meditation. As you turn to leave you whisper under your breath, \"And don't do anything fun.\".\nFortunately, she doesn't here you.",
       "destination": "TREES6",
       "flag": "ASCETICACCEPTED"
   },
   "BAYSIDE1": {
       "description": "You come out of the forest onto another beach. But instead of surf and ocean this appears to be a tidal bay. You can see across it to the mainland and where the water might be later today is a vast mudflat.",
       "options": [
           {
               "label": "Follow the beach.",
               "destinations": {
                   "if": "not SHINY",
                   "then": "BAYSIDE2",
                   "else": "BAYSIDE3"
               }
           },
           {
               "label": "Enter the forest.",
               "destination": "TREES7"
           }
       ]
   },
   "BAYSIDE2": {
       "description": "Something far out on the mudflat catches the sun with a flash of light.",
       "options": [
           {
               "label": "Investigate the shiny object",
               "destination": "MUDFLAT"
           },
           {
               "label": "Follow the beach",
               "destination": "BAYSIDE3"
           }
       ]
   },
   "MUDFLAT": {
       "description": "You trudge for seemingly forever out onto the mudlfat. Finally you come upon the shiny object. It comes free of the muck with SLUUUUP sound. It's roundish, about as big as a grapefruit, kind of heavy. And it's uh...\n shiny. \n\nYou blink and suddenly realize you've been staring at it for a long time. Meanwhile your feet, ankles and calves have sunk into the muck.\nA stream of water is running by. The tide is coming in.",
       "options": [
           {
               "label": "Try to extricate yourself.",
               "destination": "MUD1"
           },
           {
               "label": "Stare at the shiny object some more.",
               "destination": "STARE"
           }
       ]
   },
   "STARE": {
       "description": "Though very captivating, it is difficult to truly appreciate the shiny object while sinking to your doom.",
       "destination": "MUD1"
   },
   "MUD1": {
       "description": "The sucking mud has a death grip (literally) on your legs. Though you struggle with all your might, it only pulls you down deeper. It is up to you middle now. The water is rapidly rising too.",
       "options": [
           {
               "label": "Throw the shiny thing so you can use your hands to pull yourself out.",
               "destination": "DOGRESCUE1"
           },
           {
               "label": "Stare at the shiny object some more.",
               "destination": "STARE"
           }
       ]
   },
   "DOGRESCUE1": {
       "description": "The shiny round thing flies through the air and though your impending death is growing closer you still feel compelled to watch it's graceful arc, flashing in the sunlight. Just as it nears the water a huge black dog leaps into the air and catches the shiny thing in it's mouth. The dog splashes through the tide toward you. You grab onto it's thick coat and it easily pulls you free of the muck with a loud, \"SLUUUURP!\"",
       "destination": "DOGRESCUE2"
   },
   "DOGRESCUE2": {
       "description": "The big dog pulls you to the shore. Once there it drops the shiny thing at your feet and sits down. It's big tongue lolling out of it's mouth. You pick it up.",
       "flag": "SHINY",
       "options": [
           {
               "label": "\"Good dog.\"",
               "destination": "BAYSIDE3"
           }
       ]
   },
   "BAYSIDE3": {
       "description": "A gravel road runs alongside the bay and ends abrubtly at a boat ramp. A dilapidated house sits between the road and the bay.",
       "options": [
            {
                "label": "Approach the dilapidated house.",
                "destination": "HOUSE"
            },
            {
                "label": "Follow the road.",
                "destination": "ROAD1"
            },
            {
                "label": "Follow the beach",
                "destinations": {
                   "if": "not SHINY",
                   "then": "BAYSIDE2",
                   "else": "BAYSIDE3"
               }
            }
       ]
   }



}

